Revit.AnalysisDisplay.FaceAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,Analysis.ISurfaceData{Autodesk.DesignScript.Geometry.UV,System.Double},System.String,System.String,System.Type)
view:
data:
resultsName:
description:
unitType:

Revit.AnalysisDisplay.FaceAnalysisDisplay.ByViewFacePointsAndValues(Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV[],System.Double[],System.String,System.String,System.Type)
Show a colored Face Analysis Display in the Revit view.
view: The view into which you want to draw the analysis results.
surface: The surface which you want to show color.
sampleLocations: The locations at which you want to create analysis values.
samples: The analysis values at the given locations.
name: An optional analysis results name to show on the results legend.
description: An optional analysis results description to show on the results legend.
unitType: An optional Unit type to provide conversions in the analysis results.
Returns: A FaceAnalysisDisplay object.